fcyjyjfc/stm32mp1xx-driver/Driver_Test/source/adc_test.c
#include <string.h>
#include <stdint.h>
#include "stm32mp1xx_adc.h"
#include "stm32mp1xx_btimer.h"
#include "stm32mp1xx_usart.h"
#include "stm32mp1xx_iwdg.h"
#include "stm32mp1xx_rcc.h"
#include "stm32mp1xx_exti.h"
#include "stm32mp1xx_gic.h"
#include "stm32mp1xx_gpio.h"
#include "test_common.h"

/* 内部通道（仅 ADC2）*/
static const uint32_t g_chans[] = {
    ADC2_CH_VSENSE,
    ADC2_CH_VREFINT,
    ADC2_CH_VDDCORE,
    ADC2_CH_VBAT,
    ADC2_CH_DAC1,
    ADC2_CH_DAC2,
};
static const char *g_names[] = {
    "VSENSE ",
    "VREFINT",
    "VDDCORE",
    "VBAT/4 ",
    "DAC1   ",
    "DAC2   ",
};
#define CHAN_N  (sizeof(g_chans) / sizeof(g_chans[0]))

/* ========================================================================
 *  辅助
 * ======================================================================== */

static void Tim6Init(void)
{
    RCC->MP_APB1ENSETR |= 1 << 4;

    BasicTimerCfg_t cfg;
    cfg.tim_psc  = 15999;
    cfg.tim_arr  = 63999;                             /* ~1Hz @64MHz */
    cfg.tim_arpe = 1;
    cfg.tim_opm  = 0;
    cfg.tim_urs  = 0;
    cfg.tim_udis = 0;
    cfg.tim_ude  = 0;
    cfg.tim_uie  = 0;
    BasicTimerCfg(TIM6, &cfg);
    BasicTimerSetTrgo(TIM6, BTIM_TRGO_UPDATE);                      /* MMS=010: 更新事件 → TRGO */
}

/* ========================================================================
 *  测试 1：单次模式（TIM6 每触发一次转一轮全部通道）
 * ======================================================================== */

static void TestSingleSeq(void)
{
    RCC->MP_AHB2ENSETR |= (1u << 5);
    AdcSetVrefint(1);
    AdcSetTempSensor(1);
    AdcSetVbat(1);
    Adc2SetVddcore(1);

    AdcPowerUp(ADC_IDX2);
    AdcCalibrate(ADC_IDX2, 0, 0);
    AdcSetPrescaler(1);
    AdcSetResolution(ADC_IDX2, ADC_RES_12BIT);
    AdcSetContMode(ADC_IDX2, ADC_SINGLE);
    AdcSetAutoDelay(ADC_IDX2, 0);
    AdcSetRegularSeq(ADC_IDX2, CHAN_N, g_chans);
    AdcSetExtTrig(ADC_IDX2, ADC_EXTSEL_TIM6_TRGO, ADC_TRIG_RISING);    /* TIM6_TRGO 上升沿触发 */
    AdcEnable(ADC_IDX2);
    Tim6Init();
    BasicTimerStart(TIM6);
    AdcStart(ADC_IDX2);                              /* 等待硬件触发 */

    PRINT("\r\n--- Test 1: Single CONT=0 AUTDLY=0 EXT=13(TRIG_RISING) TIM6_TRGO ---\r\n");

    uint32_t ch_idx = 0;
    while (1)
    {
        IwdgKickDog(IWDG2);
        uint8_t ch;

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOC))
        {
            uint32_t val = AdcRead(ADC_IDX2);
            PrintU32(g_names[ch_idx], val);
            if (++ch_idx >= CHAN_N)
                ch_idx = 0;
        }

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOS))
        {
            AdcClearEos(ADC_IDX2);
            PRINT("--- EOS ---\r\n");
        }

        if (UsartReadOne(USART4, &ch))
            break;
    }

    BasicTimerStop(TIM6);
    AdcStop(ADC_IDX2);
    AdcDisable(ADC_IDX2);
    AdcPowerDown(ADC_IDX2);
}

/* ========================================================================
 *  测试 2：连续模式（软件触发一次，连续转换）
 * ======================================================================== */

static void TestContinuous(void)
{
    RCC->MP_AHB2ENSETR |= (1u << 5);
    AdcSetVrefint(1);
    AdcSetTempSensor(1);
    AdcSetVbat(1);
    Adc2SetVddcore(1);

    AdcPowerUp(ADC_IDX2);
    AdcCalibrate(ADC_IDX2, 0, 0);
    AdcSetPrescaler(1);
    AdcSetResolution(ADC_IDX2, ADC_RES_12BIT);
    AdcSetContMode(ADC_IDX2, ADC_CONTINUOUS);
    AdcSetAutoDelay(ADC_IDX2, 0);
    AdcSetRegularSeq(ADC_IDX2, CHAN_N, g_chans);
    AdcSetExtTrig(ADC_IDX2, 0, ADC_TRIG_SOFTWARE);   /* 软件触发 */
    AdcEnable(ADC_IDX2);
    AdcStart(ADC_IDX2);                              /* 触发一次，连续转换 */

    PRINT("\r\n--- Test 2: Continuous CONT=1 AUTDLY=0 EXT=0(SW) OVR risk ---\r\n");

    uint32_t ch_idx = 0;
    while (1)
    {
        IwdgKickDog(IWDG2);
        uint8_t ch;

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOC))
        {
            uint32_t val = AdcRead(ADC_IDX2);
            PrintU32(g_names[ch_idx], val);
            if (++ch_idx >= CHAN_N)
                ch_idx = 0;
        }

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOS))
        {
            AdcClearEos(ADC_IDX2);
            PRINT("--- EOS ---\r\n");
        }

        if (UsartReadOne(USART4, &ch))
            break;
    }

    AdcStop(ADC_IDX2);
    AdcDisable(ADC_IDX2);
    AdcPowerDown(ADC_IDX2);
}

/* ========================================================================
 *  测试 3：单次模式（软件触发一次，跑一轮停）
 * ======================================================================== */

static void TestSingleSw(void)
{
    RCC->MP_AHB2ENSETR |= (1u << 5);
    AdcSetVrefint(1);
    AdcSetTempSensor(1);
    AdcSetVbat(1);
    Adc2SetVddcore(1);

    AdcPowerUp(ADC_IDX2);
    AdcCalibrate(ADC_IDX2, 0, 0);
    AdcSetPrescaler(1);
    AdcSetResolution(ADC_IDX2, ADC_RES_12BIT);
    AdcSetContMode(ADC_IDX2, ADC_SINGLE);
    AdcSetAutoDelay(ADC_IDX2, 0);
    AdcSetRegularSeq(ADC_IDX2, CHAN_N, g_chans);
    AdcSetExtTrig(ADC_IDX2, 0, ADC_TRIG_SOFTWARE);   /* 软件触发 */
    AdcEnable(ADC_IDX2);
    AdcStart(ADC_IDX2);                              /* 触发一次，跑一轮 */

    PRINT("\r\n--- Test 3: Single CONT=0 AUTDLY=0 EXT=0(SW) one shot ---\r\n");

    uint32_t ch_idx = 0;
    while (1)
    {
        IwdgKickDog(IWDG2);
        uint8_t ch;

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOC))
        {
            uint32_t val = AdcRead(ADC_IDX2);
            PrintU32(g_names[ch_idx], val);
            ++ch_idx;
        }

        if ((ch_idx == CHAN_N) && AdcGetFlag(ADC_IDX2, ADC_FLAG_EOS))
        {
            AdcClearEos(ADC_IDX2);
            PRINT("--- EOS (done) ---\r\n");
            break;
        }

        if (UsartReadOne(USART4, &ch))
            break;
    }

    AdcStop(ADC_IDX2);
    AdcDisable(ADC_IDX2);
    AdcPowerDown(ADC_IDX2);
}

/* ========================================================================
 *  测试 4：不连续模式（DISCEN=1, DISCNUM=1）
 *  每次触发转 1 个通道，需要 6 次触发走完一轮。
 * ======================================================================== */

static void TestDiscontinuous(void)
{
    RCC->MP_AHB2ENSETR |= (1u << 5);
    AdcSetVrefint(1);
    AdcSetTempSensor(1);
    AdcSetVbat(1);
    Adc2SetVddcore(1);

    AdcPowerUp(ADC_IDX2);
    AdcCalibrate(ADC_IDX2, 0, 0);
    AdcSetPrescaler(1);
    AdcSetResolution(ADC_IDX2, ADC_RES_12BIT);
    AdcSetDiscMode(ADC_IDX2, 2);                     /* DISCEN=1, DISCNUM=2：每次触发转 2 个通道 */
    AdcSetAutoDelay(ADC_IDX2, 0);
    AdcSetRegularSeq(ADC_IDX2, CHAN_N, g_chans);
    AdcSetExtTrig(ADC_IDX2, ADC_EXTSEL_TIM6_TRGO, ADC_TRIG_RISING);    /* TIM6_TRGO 上升沿触发 */
    AdcEnable(ADC_IDX2);
    Tim6Init();
    BasicTimerStart(TIM6);
    AdcStart(ADC_IDX2);

    PRINT("\r\n--- Test 4: Discontinuous CONT=0 AUTDLY=0 DISC=2 EXT=13(TIM6_TRGO) ---\r\n");

    uint32_t seq_cnt = 0;
    uint32_t ch_pos  = 0;                            /* 当前在序列中的位置 */
    while (1)
    {
        IwdgKickDog(IWDG2);
        uint8_t ch;

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOC))
        {
            uint32_t val = AdcRead(ADC_IDX2);
            char buf[48];
            int p = 0;
            const char *s = g_names[ch_pos];
            while (*s) buf[p++] = *s++;
            buf[p++] = ':';
            buf[p++] = ' ';
            NumToStr(buf + p, val);
            while (buf[p]) p++;
            buf[p++] = '\r';
            buf[p++] = '\n';
            UsartWrite(USART4, (void *)buf, p);

