fcyjyjfc/stm32mp1xx-driver/Driver_Test/source/adc_test.c
            ch_pos++;
        }

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOS))
        {
            AdcClearEos(ADC_IDX2);
            ch_pos = 0;
            seq_cnt++;
            char buf[16];
            int p = 0;
            PRINT("  --- EOS #");
            NumToStr(buf, seq_cnt);
            while (buf[p]) p++;
            buf[p++] = '\r';
            buf[p++] = '\n';
            UsartWrite(USART4, (void *)buf, p);
        }

        if (UsartReadOne(USART4, &ch))
            break;
    }

    BasicTimerStop(TIM6);
    AdcStop(ADC_IDX2);
    AdcDisable(ADC_IDX2);
    AdcSetDiscMode(ADC_IDX2, 0);
    AdcPowerDown(ADC_IDX2);
}

/* ========================================================================
 *  测试 5：溢出阻塞演示（OVR MODE = PRESERVE）
 *  不读 DR，让溢出阻塞序列，观察 OVR 标志。
 * ======================================================================== */

static void TestOvrBlock(void)
{
    RCC->MP_AHB2ENSETR |= (1u << 5);
    AdcSetVrefint(1);
    AdcSetTempSensor(1);
    AdcSetVbat(1);
    Adc2SetVddcore(1);

    AdcPowerUp(ADC_IDX2);
    AdcCalibrate(ADC_IDX2, 0, 0);
    AdcSetPrescaler(1);
    AdcSetResolution(ADC_IDX2, ADC_RES_12BIT);
    AdcSetContMode(ADC_IDX2, ADC_SINGLE);
    AdcSetAutoDelay(ADC_IDX2, 0);
    AdcSetRegularSeq(ADC_IDX2, CHAN_N, g_chans);
    AdcSetExtTrig(ADC_IDX2, 0, ADC_TRIG_SOFTWARE);

    /* 使用默认 OVR MODE = PRESERVE（阻塞），不调用 AdcSetOvrMode */
    AdcEnable(ADC_IDX2);
    AdcStart(ADC_IDX2);

    PRINT("\r\n--- Test 5: OVR block CONT=0 AUTDLY=0 OVRMODE=PRESERVE no DR read ---\r\n");

    while (1)
    {
        IwdgKickDog(IWDG2);
        uint8_t ch;

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOS))
        {
            AdcClearEos(ADC_IDX2);
            PRINT("--- EOS (sequence complete) ---\r\n");
        }

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_OVR))
        {
            PRINT("OVR detected! Sequence blocked (EOS never comes).\r\n");
            PRINT("Press any key to exit.\r\n");
            break;
        }

        if (UsartReadOne(USART4, &ch))
            break;
    }

    AdcStop(ADC_IDX2);
    AdcDisable(ADC_IDX2);
    AdcPowerDown(ADC_IDX2);
}

/* ========================================================================
 *  测试 6：连续模式 + 自动延迟（AUTDLY=1，每转换等 DR 读取，防溢出）
 * ======================================================================== */

static void TestContinuousAutoDelay(void)
{
    RCC->MP_AHB2ENSETR |= (1u << 5);
    AdcSetVrefint(1);
    AdcSetTempSensor(1);
    AdcSetVbat(1);
    Adc2SetVddcore(1);

    AdcPowerUp(ADC_IDX2);
    AdcCalibrate(ADC_IDX2, 0, 0);
    AdcSetPrescaler(1);
    AdcSetResolution(ADC_IDX2, ADC_RES_12BIT);
    AdcSetContMode(ADC_IDX2, ADC_CONTINUOUS);
    AdcSetAutoDelay(ADC_IDX2, 1);                        /* 每转换完等待 DR 被读，防 OVR */
    AdcSetRegularSeq(ADC_IDX2, CHAN_N, g_chans);
    AdcSetExtTrig(ADC_IDX2, 0, ADC_TRIG_SOFTWARE);
    AdcEnable(ADC_IDX2);
    AdcStart(ADC_IDX2);

    PRINT("\r\n--- Test 6: Continuous+AUTDLY CONT=1 AUTDLY=1 EXT=0(SW) no OVR ---\r\n");

    uint32_t ch_idx = 0;
    while (1)
    {
        IwdgKickDog(IWDG2);
        uint8_t ch;

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOC))
        {
            uint32_t val = AdcRead(ADC_IDX2);
            PrintU32(g_names[ch_idx], val);
            if (++ch_idx >= CHAN_N)
                ch_idx = 0;
        }

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOS))
        {
            AdcClearEos(ADC_IDX2);
            PRINT("--- EOS ---\r\n");
        }

        if (UsartReadOne(USART4, &ch))
            break;
    }

    AdcStop(ADC_IDX2);
    AdcDisable(ADC_IDX2);
    AdcPowerDown(ADC_IDX2);
}

/* ========================================================================
 *  测试 7：注入转换（EXTI0/PA0 按键触发注入，过采样 1024x）
 * ======================================================================== */

static void exti0_inj_isr(void)
{
    ExtiClearFpr(0);
    AdcStartInjected(ADC_IDX2);
}

static void TestInjected(void)
{
    RCC->MP_AHB2ENSETR |= (1u << 5);
    AdcSetVrefint(1);
    AdcSetTempSensor(1);
    AdcSetVbat(1);
    Adc2SetVddcore(1);

    AdcPowerUp(ADC_IDX2);
    AdcCalibrate(ADC_IDX2, 0, 0);
    AdcSetPrescaler(1);
    AdcSetResolution(ADC_IDX2, ADC_RES_16BIT);

    /* 常规组：6 个内部通道，连续模式 */
    AdcSetContMode(ADC_IDX2, ADC_CONTINUOUS);
    AdcSetAutoDelay(ADC_IDX2, 1);
    AdcSetRegularSeq(ADC_IDX2, CHAN_N, g_chans);
    AdcSetExtTrig(ADC_IDX2, 0, ADC_TRIG_SOFTWARE);

    /* 注入组：通道 1（外部滑动变阻器），采样最大，过采样 1024x 右移 10 */
    AdcSetChanPreselect(ADC_IDX2, (1u << 1));
    AdcSetSampleTime(ADC_IDX2, 1, ADC_SMP_810P5);
    uint32_t inj_ch[] = { 1 };
    AdcSetInjectedSeq(ADC_IDX2, 1, inj_ch, 0, ADC_TRIG_SOFTWARE);
    AdcSetOverSample(ADC_IDX2, 1023, 10, 0, 1);

    AdcEnable(ADC_IDX2);
    AdcStart(ADC_IDX2);

    /* ---- EXTI0/PA0 按键中断 ---- */
    RCC->MP_AHB4ENSETR |= 1 << 0;
    GpioMode(GPIO_A, 0, GPIO_MODER_INPUT);
    GpioPullUpDown(GPIO_A, 0, GPIO_PUPDR_PULL_UP);
    ExtiSetGpio(0, EXTI_GPIO_PA);
    ExtiSetTrig(0, 2);
    ExtiEnableInt(1, 0);
    GicdSetGroup(GIC_EXTI0);
    GicdSetPriority(GIC_EXTI0, 5);
    GicdSetTarget(GIC_EXTI0, 1);
    GicdSetTrigMode(GIC_EXTI0, 0);
    GicRegisterIrq(GIC_EXTI0, exti0_inj_isr);
    GicdEnableInt(GIC_EXTI0);
    GicdInit();
    GiccInit(10, 2);
    __asm__ volatile(
        "mrs r0, cpsr\n\t"
        "bic r0, r0, #0x80\n\t"
        "msr cpsr, r0\n\t"
        :: : "r0"
    );

    PRINT("\r\n--- Test 7: Injected CONT=1 AUTDLY=1 EXT=0(SW) EXTI0 triggers inj ch1 OS=1024x ---\r\n");
    PRINT("Press PA0 button to trigger injected conversion\r\n");

    uint32_t reg_idx = 0;
    while (1)
    {
        IwdgKickDog(IWDG2);
        uint8_t ch;

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOC))
        {
            uint32_t val = AdcRead(ADC_IDX2);
            PrintU32(g_names[reg_idx], val);
            if (++reg_idx >= CHAN_N)
                reg_idx = 0;
        }

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOS))
        {
            AdcClearEos(ADC_IDX2);
            PRINT("--- EOS ---\r\n");
        }

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_JEOS))
        {
        	PRINT("*********************************************************\r\n\r\n\r\n\r\n");
            AdcClearJeos(ADC_IDX2);
            uint32_t val = AdcReadInjected(ADC_IDX2, 0);
            uint32_t mv = val * 3300 / 65536;
            char buf[64];
            int p = 0;
            const char *s = "  [INJ ch1: ";
            while (*s) buf[p++] = *s++;
            NumToStr(buf + p, val);
            while (buf[p]) p++;
            s = " = ";
            while (*s) buf[p++] = *s++;
            NumToStr(buf + p, mv);
            while (buf[p]) p++;
            s = " mV]\r\n";


            while (*s) buf[p++] = *s++;
            UsartWrite(USART4, (void *)buf, p);
            PRINT("*********************************************************\r\n\r\n\r\n\r\n");
        }

