fcyjyjfc/stm32mp1xx-driver/Driver_Test/source/adc_test.c
        if (UsartReadOne(USART4, &ch))
            break;
    }

    GicdDisableInt(GIC_EXTI0);
    ExtiDisableInt(1, 0);
    __asm__ volatile(
        "mrs r0, cpsr\n\t"
        "orr r0, r0, #0x80\n\t"
        "msr cpsr, r0\n\t"
        :: : "r0"
    );
    AdcStop(ADC_IDX2);
    AdcDisable(ADC_IDX2);
    AdcSetOverSample(ADC_IDX2, 0, 0, 0, 0);
    AdcSetChanPreselect(ADC_IDX2, 0);
    AdcPowerDown(ADC_IDX2);
}

/* ========================================================================
 *  测试 8：自动注入（JAUTO=1，TIM6 触发常规组后自动启动注入）
 * ======================================================================== */

static void TestAutoInject(void)
{
    RCC->MP_AHB2ENSETR |= (1u << 5);
    AdcSetVrefint(1);
    AdcSetTempSensor(1);
    AdcSetVbat(1);
    Adc2SetVddcore(1);

    AdcPowerUp(ADC_IDX2);
    AdcCalibrate(ADC_IDX2, 0, 0);
    AdcSetPrescaler(1);
    AdcSetResolution(ADC_IDX2, ADC_RES_16BIT);

    /* 常规组：6 个内部通道，TIM6 触发单次 */
    AdcSetContMode(ADC_IDX2, ADC_SINGLE);
    AdcSetAutoDelay(ADC_IDX2, 0);
    AdcSetRegularSeq(ADC_IDX2, CHAN_N, g_chans);
    AdcSetExtTrig(ADC_IDX2, ADC_EXTSEL_TIM6_TRGO, ADC_TRIG_RISING);

    /* 注入组：通道 1，过采样 1024x，JAUTO 自动触发（JEXTEN=0） */
    AdcSetChanPreselect(ADC_IDX2, (1u << 1));
    AdcSetSampleTime(ADC_IDX2, 1, ADC_SMP_810P5);
    uint32_t inj_ch[] = { 1 };
    AdcSetInjectedSeq(ADC_IDX2, 1, inj_ch, 0, ADC_TRIG_SOFTWARE);
    AdcSetOverSample(ADC_IDX2, 1023, 10, 0, 1);
    AdcSetAutoInject(ADC_IDX2, 1);                      /* JAUTO=1：EOS 后自动启动注入 */

    AdcEnable(ADC_IDX2);
    Tim6Init();
    BasicTimerStart(TIM6);
    AdcStart(ADC_IDX2);

    PRINT("\r\n--- Test 8: AutoInject CONT=0 EXT=TIM6_TRGO JAUTO=1 inj OS=1024x ---\r\n");

    uint32_t reg_idx = 0;
    while (1)
    {
        IwdgKickDog(IWDG2);
        uint8_t ch;

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOC))
        {
            uint32_t val = AdcRead(ADC_IDX2);
            PrintU32(g_names[reg_idx], val);
            if (++reg_idx >= CHAN_N)
                reg_idx = 0;
        }

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOS))
        {
            AdcClearEos(ADC_IDX2);
            PRINT("--- EOS (regular done, JAUTO starts injected) ---\r\n");
        }

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_JEOS))
        {
            AdcClearJeos(ADC_IDX2);
            uint32_t val = AdcReadInjected(ADC_IDX2, 0);
            uint32_t mv = val * 3300 / 65536;
            char buf[64];
            int p = 0;
            const char *s = "  [INJ ch1: ";
            while (*s) buf[p++] = *s++;
            NumToStr(buf + p, val);
            while (buf[p]) p++;
            s = " = ";
            while (*s) buf[p++] = *s++;
            NumToStr(buf + p, mv);
            while (buf[p]) p++;
            s = " mV]\r\n";
            while (*s) buf[p++] = *s++;
            UsartWrite(USART4, (void *)buf, p);
        }

        if (UsartReadOne(USART4, &ch))
            break;
    }

    BasicTimerStop(TIM6);
    AdcStop(ADC_IDX2);
    AdcDisable(ADC_IDX2);
    AdcSetAutoInject(ADC_IDX2, 0);
    AdcSetOverSample(ADC_IDX2, 0, 0, 0, 0);
    AdcSetChanPreselect(ADC_IDX2, 0);
    AdcPowerDown(ADC_IDX2);
}

/* ========================================================================
 *  测试 9：模拟看门狗（AWD1 + AWD2，监控通道 1，不同阈值）
 * ======================================================================== */

static void TestAwd1(void)
{
    RCC->MP_AHB2ENSETR |= (1u << 5);

    AdcPowerUp(ADC_IDX2);
    AdcCalibrate(ADC_IDX2, 0, 0);
    AdcSetPrescaler(1);
    AdcSetResolution(ADC_IDX2, ADC_RES_16BIT);

    /* 常规组：仅通道 1，TIM6 触发单次 */
    AdcSetContMode(ADC_IDX2, ADC_SINGLE);
    AdcSetAutoDelay(ADC_IDX2, 0);
    uint32_t ch1[] = { 1 };
    AdcSetRegularSeq(ADC_IDX2, 1, ch1);
    AdcSetExtTrig(ADC_IDX2, ADC_EXTSEL_TIM6_TRGO, ADC_TRIG_RISING);

    /* 通道预选 + 采样时间 */
    AdcSetChanPreselect(ADC_IDX2, (1u << 1));
    AdcSetSampleTime(ADC_IDX2, 1, ADC_SMP_810P5);

    /* 看门狗 1：监控通道 1，LTR=1V，HTR=2V */
    uint32_t ltr1 = 65535u * 1000 / 3300;     /* 19859 = 1V */
    uint32_t htr1 = 65535u * 2000 / 3300;     /* 39718 = 2V */
    AdcSetAwd1(ADC_IDX2, 1, 0, 1, 1, ltr1, htr1);

    /* 看门狗 2：监控通道 1，LTR=1.2V，HTR=1.8V */
    uint32_t ltr2 = 65535u * 1200 / 3300;     /* 23831 = 1.2V */
    uint32_t htr2 = 65535u * 1800 / 3300;     /* 35746 = 1.8V */
    AdcSetAwd2(ADC_IDX2, (1u << 1), ltr2, htr2);

    AdcEnable(ADC_IDX2);
    Tim6Init();
    BasicTimerStart(TIM6);
    AdcStart(ADC_IDX2);

    PRINT("\r\n--- Test 9: AWD1+2 CONT=0 EXT=TIM6_TRGO ch1 ---\r\n");
    PRINT("  AWD1: 1V~2V   AWD2: 1.2V~1.8V\r\n");

    while (1)
    {
        IwdgKickDog(IWDG2);
        uint8_t ch;

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_EOC))
        {
            uint32_t val = AdcRead(ADC_IDX2);
            uint32_t mv = val * 3300 / 65536;
            PrintU32("ch1", val);
            char mv_str[12];
            NumToStr(mv_str, mv);
            PRINT("  (");
            PRINT(mv_str);
            PRINT(" mV)\r\n");
        }

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_AWD1))
        {
            AdcClearFlag(ADC_IDX2, ADC_FLAG_AWD1);
            PRINT("*** AWD1: voltage OUT OF RANGE (1V~2V) ***\r\n");
        }

        if (AdcGetFlag(ADC_IDX2, ADC_FLAG_AWD2))
        {
            AdcClearFlag(ADC_IDX2, ADC_FLAG_AWD2);
            PRINT("*** AWD2: voltage OUT OF RANGE (1.2V~1.8V) ***\r\n");
        }

        if (UsartReadOne(USART4, &ch))
            break;
    }

    BasicTimerStop(TIM6);
    AdcStop(ADC_IDX2);
    AdcDisable(ADC_IDX2);
    AdcSetAwd1(ADC_IDX2, 0, 0, 0, 0, 0, 0);
    AdcSetAwd2(ADC_IDX2, 0, 0, 0);
    AdcSetChanPreselect(ADC_IDX2, 0);
    AdcPowerDown(ADC_IDX2);
}

/* ========================================================================
 *  测试 10：双 ADC 同步模式（DUAL=REG_SIMULT，ADC1 ch1 + ADC2 VREFINT）
 * ======================================================================== */

static void TestDual(void)
{
    RCC->MP_AHB2ENSETR |= (1u << 4) | (1u << 5);
    AdcSetVrefint(1);
    AdcSetTempSensor(1);
    AdcSetVbat(1);
    Adc2SetVddcore(1);
    AdcSetPrescaler(1);                         /* 和其他测试保持一致的时钟分频 */
    AdcSetCkMode(ADC_CK_ASYNC);

    /* === ADC1 配置（主，外部通道 1 滑动变阻器）=== */
    AdcPowerUp(ADC_IDX1);
    AdcCalibrate(ADC_IDX1, 0, 0);
    AdcSetResolution(ADC_IDX1, ADC_RES_16BIT);
    AdcSetContMode(ADC_IDX1, ADC_SINGLE);
    AdcSetAutoDelay(ADC_IDX1, 0);
    uint32_t adc1_ch[] = { 1 };
    AdcSetRegularSeq(ADC_IDX1, 1, adc1_ch);
    AdcSetExtTrig(ADC_IDX1, ADC_EXTSEL_TIM6_TRGO, ADC_TRIG_RISING);
    AdcSetChanPreselect(ADC_IDX1, (1u << 1));
    AdcSetSampleTime(ADC_IDX1, 1, ADC_SMP_810P5);

