fcyjyjfc/stm32mp1xx-driver/Driver_Test/source/adc_test.c
    /* === ADC2 配置（从，内部 VREFINT）=== */
    AdcPowerUp(ADC_IDX2);
    AdcCalibrate(ADC_IDX2, 0, 0);
    AdcSetResolution(ADC_IDX2, ADC_RES_16BIT);
    AdcSetContMode(ADC_IDX2, ADC_SINGLE);
    AdcSetAutoDelay(ADC_IDX2, 0);
    AdcSetSampleTime(ADC_IDX2, ADC2_CH_VREFINT, ADC_SMP_810P5);
    uint32_t adc2_ch[] = { ADC2_CH_VREFINT };
    AdcSetRegularSeq(ADC_IDX2, 1, adc2_ch);

    /* === 双 ADC 模式：常规同步（必须在两个 ADC 都禁用时配置）=== */
    ADC->COMM.CCR = (ADC->COMM.CCR & ~0x1Fu) | ADC_DUAL_REG_SIMULT;

    /* === 使能双 ADC 前确认状态 === */
    if (!AdcEnable(ADC_IDX1))
        PRINT("ADC1 enable FAIL\r\n");
    if (!AdcEnable(ADC_IDX2))
        PRINT("ADC2 enable FAIL\r\n");

    Tim6Init();
    BasicTimerStart(TIM6);
    AdcStart(ADC_IDX1);                       /* 触发主 ADC1，ADC2 同步跟随 */

    {
        /* 打印 DUAL 模式值确认 */
        char dbg[40];
        int dp = 0;
        const char *ds = "DUAL=";
        while (*ds) dbg[dp++] = *ds++;
        uint32_t dual_val = ADC->COMM.CCR & 0x1Fu;
        NumToStr(dbg + dp, dual_val);
        while (dbg[dp]) dp++;
        ds = "\r\n";
        while (*ds) dbg[dp++] = *ds++;
        UsartWrite(USART4, (void *)dbg, dp);
    }

    PRINT("--- Test 10: Dual REG_SIMULT ADC1 ch1(ext) + ADC2 VREFINT TIM6 trig ---\r\n");

    while (1)
    {
        IwdgKickDog(IWDG2);
        uint8_t ch;

        /* 等待两个 ADC 都完成转换 */
        if (AdcGetFlag(ADC_IDX1, ADC_FLAG_EOC) && AdcGetFlag(ADC_IDX2, ADC_FLAG_EOC))
        {
            uint32_t val1 = AdcRead(ADC_IDX1);
            uint32_t val2 = AdcRead(ADC_IDX2);
            uint32_t mv1 = val1 * 3300 / 65536;
            uint32_t mv2 = val2 * 3300 / 65536;

            char buf[128];
            int p = 0;
            const char *s = "ADC1 ch1: raw=";
            while (*s) buf[p++] = *s++;
            NumToStr(buf + p, val1);
            while (buf[p]) p++;
            s = " (";
            while (*s) buf[p++] = *s++;
            NumToStr(buf + p, mv1);
            while (buf[p]) p++;
            s = " mV)  ADC2 VREFINT: raw=";
            while (*s) buf[p++] = *s++;
            NumToStr(buf + p, val2);
            while (buf[p]) p++;
            s = " (";
            while (*s) buf[p++] = *s++;
            NumToStr(buf + p, mv2);
            while (buf[p]) p++;
            s = " mV)\r\n";
            while (*s) buf[p++] = *s++;
            UsartWrite(USART4, (void *)buf, p);
        }

        if (UsartReadOne(USART4, &ch))
            break;
    }

    BasicTimerStop(TIM6);
    AdcStop(ADC_IDX1);
    AdcStop(ADC_IDX2);
    AdcDisable(ADC_IDX1);
    AdcDisable(ADC_IDX2);
    ADC->COMM.CCR &= ~0x1Fu;                 /* 恢复独立模式 */
    AdcSetChanPreselect(ADC_IDX1, 0);
    AdcPowerDown(ADC_IDX1);
    AdcPowerDown(ADC_IDX2);
}

/* ========================================================================
 *  二级菜单入口
 * ======================================================================== */

static const MenuEntry_t adc_menu[] = {
    { "1",  "Single (TIM6 TRGO)",           TestSingleSeq },
    { "2",  "Continuous (SW, OVR risk)",     TestContinuous },
    { "3",  "Single (SW, one shot)",         TestSingleSw },
    { "4",  "Discontinuous (DISC=2, TIM6)",  TestDiscontinuous },
    { "5",  "OVR block (PRESERVE, no read)", TestOvrBlock },
    { "6",  "Continuous + AUTDLY",           TestContinuousAutoDelay },
    { "7",  "Injected (EXTI0 OS=1024x)",     TestInjected },
    { "8",  "AutoInject (JAUTO=1 OS=1024x)", TestAutoInject },
    { "9",  "AWD1+2 (ch1 1V~2V/1.2V~1.8V)", TestAwd1 },
    { "10", "Dual REG_SIMULT (ADC1+ADC2)",   TestDual },
};

void AdcTest(void)
{
    RunSubMenu("ADC Test", adc_menu, sizeof(adc_menu) / sizeof(adc_menu[0]));
}
